;
; 虚拟桌面 Dextop 快捷键按拓展
; 部分快捷键与Win系统冲突 无法通过软件中配置 故在此处进行处理
;

; 切换桌面
<#1::#^!1
<#2::#^!2
<#3::#^!3
<#q::#^!q
<#w::#^!w
<#e::#^!e
<#a::#^!a
<#s::#^!s
<#d::#^!d

; 窗口移动到桌面
<#+1::#^!+1
<#+2::#^!+2
<#+3::#^!+3
<#+q::#^!+q
<#+w::#^!+w
<#+e::#^!+e
<#+a::#^!+a
<#+s::#^!+s
<#+d::#^!+d

; 上一个桌面
<#CapsLock::
    Send, #^!+{CapsLock}
    SetCapsLockState, Off
Return

;最小化到系统托盘
<#Esc::#^!+Esc

;DexTab任务切换器
; <#`::

; 窗口透明度
<#PgUp::#^!+PgUp
<#PgDn::#^!+PgDn

; 窗口目录 
LWin & LAlt::#^!+[

; 全屏预览
LWin & LCtrl::#^!+]
